app/views/users/show.html.erb

SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = $1  [["user_id", 3]]
---
    <div class="col-md-6 offset-md-3">
      <% @user.groups.each do |group| %>