app/views/events/run.html.erb

SELECT "groups".* FROM "groups" WHERE "groups"."event_id" = $1  [["event_id", 1]]
---
      <ul id="users" class="list-group">
        <% @event.groups.each do |group| %>