app/controllers/events_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "groups".* FROM "groups" WHERE "groups"."user_id" = $1 AND "groups"."event_id" = $2 ORDER BY "groups"."id" ASC LIMIT $3  [["user_id", 1], ["event_id", 1], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:id])
    if current_user.groups.where(event_id: @event.id).present?

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "groups" ("event_id", "no_of_attendees", "created_at", "updated_at", "user_id", "no_of_entrees") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["event_id", 1], ["no_of_attendees", 5], ["created_at", 2016-08-10 11:48:31 UTC], ["updated_at", 2016-08-10 11:48:31 UTC], ["user_id", 7], ["no_of_entrees", 0]]
SELECT  "groups".* FROM "groups" WHERE "groups"."user_id" = $1 AND "groups"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 1], ["LIMIT", 1]]
UPDATE "groups" SET "no_of_attendees" = $1, "updated_at" = $2 WHERE "groups"."id" = $3  [["no_of_attendees", 3], ["updated_at", 2016-08-08 15:43:24 UTC], ["id", 1]]
---
  def book

    event = Event.find(group_params[:event_id])

    if request.request_method == "POST"
      group = current_user.groups.create!(group_params)
    elsif request.request_method == "PATCH"
      group = current_user.groups.find(group_params[:id])
      original_attendees = group.no_of_attendees
      group.update(group_params)

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "groups" SET "no_of_entrees" = $1, "updated_at" = $2 WHERE "groups"."id" = $3  [["no_of_entrees", 6], ["updated_at", 2016-08-09 15:54:39 UTC], ["id", 1]]
---
  def admit
    group = Group.find(group_params[:id])
    group.no_of_entrees += group_params[:no_of_entrees].to_i
    if group.save

INSERT INTO "events" ("name", "date", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", ""], ["date", Wed, 10 Aug 2016], ["description", ""], ["user_id", 1], ["created_at", 2016-08-10 09:39:09 UTC], ["updated_at", 2016-08-10 09:39:09 UTC]]
---
  def create
    @event = current_user.events.new(event_params)


    respond_to do |format|
      if @event.save

UPDATE "events" SET "allocation" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["allocation", 100], ["updated_at", 2016-08-10 14:08:26 UTC], ["id", 5]]
---
  def update
    respond_to do |format|
      if @event.update(event_params)

SELECT "groups".* FROM "groups" WHERE "groups"."event_id" = $1  [["event_id", 1]]
---
  def run
    @event.groups.each do |group|